docs/date.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-01 Sat 13:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42 Date Tools</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Description of some free42/hp-42s/DM42 programs for dates"
 />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42 Date Tools</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-04-29 21:29:50</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4031e03">1. Metadata</a></li>
<li><a href="#introduction">2. Introduction</a></li>
<li><a href="#org717826e">3. Functionality</a>
<ul>
<li><a href="#menu">3.1. The main menu</a></li>
<li><a href="#org4cd25c5">3.2. Menu Code</a></li>
</ul>
</li>
<li><a href="#orgb34af6c">4. App Code</a></li>
<li><a href="#org8c4d8b4">5. EOF</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4031e03" class="outline-2">
<h2 id="org4031e03"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
The home for this HTML file is: <a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<p>
Directory contents:
</p>
<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>src</code></td>
<td class="org-left">-</td>
<td class="org-left">The org-mode file that generated this HTML document</td>
</tr>

<tr>
<td class="org-left"><code>src_42s</code></td>
<td class="org-left">-</td>
<td class="org-left">Ready to convert source listings for 42s code in this document</td>
</tr>

<tr>
<td class="org-left"><code>docs</code></td>
<td class="org-left">-</td>
<td class="org-left">This html document</td>
</tr>

<tr>
<td class="org-left"><code>bin</code></td>
<td class="org-left">-</td>
<td class="org-left">Importable RAW program files</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
Aside from the date/time conversion routines, the rest is just wrappers for built in functions to make them print results when called from a program.  Why?  I
wanted to put things like <code>DATE</code> in a nested custom menu, and have them print the date just as if I had directly put the function in a custom menu. ;) Now
that free42 has put these into a separate catalog menu, these are somewhat obsolete.
</p>
</div>
</div>

<div id="outline-container-org717826e" class="outline-2">
<h2 id="org717826e"><span class="section-number-2">3</span> Functionality</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-menu" class="outline-3">
<h3 id="menu"><span class="section-number-3">3.1</span> The main menu</h3>
<div class="outline-text-3" id="text-menu">
<table id="orgbcdb1ca" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Prog</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DATE</td>
<td class="org-left">LBL 95</td>
<td class="org-left">Current date*</td>
</tr>

<tr>
<td class="org-left">TIME</td>
<td class="org-left">LBL 88</td>
<td class="org-left">Current time*</td>
</tr>

<tr>
<td class="org-left">UTIME</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Return current UNIX date/time integer to stack</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DT→U</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Convert a date (Y) &amp; time (X) pair to a UNIX date/time integer</td>
</tr>

<tr>
<td class="org-left">U→DT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Convert a UNIX date/time integer into date (Y) &amp; time (X) pair</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DATE</td>
<td class="org-left">LBL 95</td>
<td class="org-left">Current date*</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">JDATE</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Return current Julian day number to stack</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">D→J</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Convert a date to a Julian day number</td>
</tr>

<tr>
<td class="org-left">J→D</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Convert a Julian day number to date*</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DATE+</td>
<td class="org-left">LBL 92</td>
<td class="org-left">Just like built in function*</td>
</tr>

<tr>
<td class="org-left">DDAYS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Just like built in funciton</td>
</tr>

<tr>
<td class="org-left">DOW</td>
<td class="org-left">LBL 91</td>
<td class="org-left">Just like built in funciton*</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Notes: * Result is both printed and pushed to the stack
</p>
</div>
</div>
